---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateFailureSingle
source: html/9cef552f-b7d4-6af7-8408-f2e7d812e251.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PathOfTravelFailures.UpdateFailureSingle Property

Path of Travel failed to update.

## Syntax (C#)
```csharp
public static FailureDefinitionId UpdateFailureSingle { get; }
```